"""
13. Дані координати двох протилежних вершин прямокутника: (x1, y1), (x2, y2). Сторони
прямокутника паралельні до осів координат. Знайти периметр і площу даного прямокутника.
Скорий Євген 141
"""

def rectangle():
    print("Запишіть координати вершини прямокутника")
    x1 = float(input("Введіть x1 = "))
    y1 = float(input("Введіть y1 = "))
    print("Запишіть координвти протилежної вершини прямокутника")
    x2 = float(input("Введіть x2 = "))
    y2 = float(input("Введіть y2 = "))
    a = abs(float(x2 - x1))
    b = abs(float(y2 - y1))
    p = float(2 * (a + b))
    s = float(a * b)
    return "Периметр прямокутника = " + str(p) + "\nПлоща прямокутника = " + str(s)

print(rectangle())